nguyentri/da-pac/svd/DA14681.svd
  </registers>
</peripheral><peripheral>
  <name>SCB</name>
  <version>1.0</version>
  <description>Cortex M0 SCB registers</description>
  <groupName>SCB</groupName>
  <baseAddress>0xE000ED00</baseAddress>
  <size>0</size>
  <addressBlock>
		<offset>0</offset>
		<size>0x29</size>
		<usage>registers</usage>
  </addressBlock>
  <registers>
	<register>
	  <name>CPUID</name>
	  <description>CPUID base register</description>
	  <addressOffset>0x00000000</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x410CC200</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>REVISION</name>
		  <description>REVISION[3:0] bits (Revision number)</description>
		  <bitRange>[3:0]</bitRange>
		  <access>read-only</access>
		</field>
		<field>
		  <name>PARTNO</name>
		  <description>PARTNO[11:0] bits (Part number of the processor core)</description>
		  <bitRange>[15:4]</bitRange>
		  <access>read-only</access>
		</field>
		<field>
		  <name>CONSTANT</name>
		  <description>CONSTANT[3:0] bits (Reads as 0xF)</description>
		  <bitRange>[19:16]</bitRange>
		  <access>read-only</access>
		</field>
		<field>
		  <name>VARIANT</name>
		  <description>VARIANT[3:0] bits (Variant number)</description>
		  <bitRange>[23:20]</bitRange>
		  <access>read-only</access>
		</field>
		<field>
		  <name>IMPLEMENTER</name>
		  <description>IMPLEMENTER[7:0] bits (Implementer code)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-only</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>ICSR</name>
	  <description>Interrupt control and state register</description>
	  <addressOffset>0x00000004</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>VECTACTIVE</name>
		  <description>VECTACTIVE[5:0] bits (Active vector)</description>
		  <bitRange>[5:0]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>VECTPENDING</name>
		  <description>VECTPENDING[5:0] bits (Pending vector)</description>
		  <bitRange>[17:12]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>ISRPENDING</name>
		  <description>Interrupt pending flag, excluding NMI and Faults</description>
		  <bitRange>[22:22]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PENDSTCLR</name>
		  <description>SysTick exception clear-pending bit</description>
		  <bitRange>[25:25]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PENDSTSET</name>
		  <description>SysTick exception set-pending bit</description>
		  <bitRange>[26:26]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PENDSVCLR</name>
		  <description>PendSV clear-pending bit</description>
		  <bitRange>[27:27]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PENDSVSET</name>
		  <description>PendSV set-pending bit</description>
		  <bitRange>[28:28]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>NMIPENDSET</name>
		  <description>NMI set-pending bit</description>
		  <bitRange>[31:31]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>AIRCR</name>
	  <description>Application interrupt and reset control register</description>
	  <addressOffset>0x0000000C</addressOffset>
	  <size>32</size>
	  <access>read-only</access>
	  <resetValue>0xFA050000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>VECTRESET</name>
		  <description>Reserved for Debug use</description>
		  <bitRange>[0:0]</bitRange>
		  <access>read-only</access>
		</field>
		<field>
		  <name>VECTCLRACTIVE</name>
		  <description>Reserved for Debug use</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-only</access>
		</field>
		<field>
		  <name>SYSRESETREQ</name>
		  <description>System reset request</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-only</access>
		</field>
		<field>
		  <name>ENDIANESS</name>
		  <description>Data endianness bit</description>
		  <bitRange>[15:15]</bitRange>
		  <access>read-only</access>
		</field>
		<field>
		  <name>VECTKEY</name>
		  <description>VECTKEY[15:0] bits (Register key)</description>
		  <bitRange>[31:16]</bitRange>
		  <access>read-only</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>SCR</name>
	  <description>System control register</description>
	  <addressOffset>0x00000010</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>SLEEPONEXIT</name>
		  <description>Configures sleep-on-exit when returning from Handler mode to Thread mode</description>
		  <bitRange>[1:1]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SLEEPDEEP</name>
		  <description>Controls whether the processor uses sleep or deep sleep</description>
		  <bitRange>[2:2]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>SEVEONPEND</name>
		  <description>Send event on pending bit</description>
		  <bitRange>[4:4]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>CCR</name>
	  <description>Configuration and control register</description>
	  <addressOffset>0x00000014</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000204</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>UNALIGN_TRP</name>
		  <description>Enables unaligned access traps</description>
		  <bitRange>[3:3]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>STKALIGN</name>
		  <description>Configures stack alignment on exception entry</description>
		  <bitRange>[9:9]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>SHPR2</name>
	  <description>System handler priority register 2</description>
	  <addressOffset>0x0000001C</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>PRI_11</name>
		  <description>PRI_11[7:0] bits (Priority of system handler 11, SVCall)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
	<register>
	  <name>SHPR3</name>
	  <description>System handler priority register 3</description>
	  <addressOffset>0x00000020</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>PRI_14</name>
		  <description>PRI_14[7:0] bits (Priority of system handler 14, PendSV)</description>
		  <bitRange>[23:16]</bitRange>
		  <access>read-write</access>
		</field>
		<field>
		  <name>PRI_15</name>
		  <description>PRI_15[7:0] bits (Priority of system handler 15, SysTick exception)</description>
		  <bitRange>[31:24]</bitRange>
		  <access>read-write</access>
		</field>
	  </fields>
	</register>
