nguyentri/da-pac/svd/DA14681.svd
	<description>lmac_manual_cca_stat shows the status of the CCA_STAT </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_LMAC_MASK_REG</name>
	<description>Lmac mask register</description>
	<addressOffset>0x00010094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>RXTIMEREXPIRED_M</name>
	<description>Mask bit for event &amp;quot;RxTimerExpired_e&amp;quot; </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CCASTAT_M</name>
	<description>Mask bit for event &amp;quot;CCAstat_e&amp;quot; </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EDSCANREADY_M</name>
	<description>Mask bit for event &amp;quot;EdScanReady_e&amp;quot; </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_MACACKWAITDURATION_REG</name>
	<description>Maximum time to wait for a ACK</description>
	<addressOffset>0x00010038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000036</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>MACACKWAITDURATION</name>
	<description>Max time to wait for a (normal) ACK </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_MACENHACKWAITDURATION_REG</name>
	<description>Maximum time to wait for an enhanced ACK frame</description>
	<addressOffset>0x0001003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000360</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>MACENHACKWAITDURATION</name>
	<description>The maximum time (in s) to wait for an enhanced acknowledgement frame </description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FTDF_MACFCSERRORCOUNT_REG</name>
	<description>Lmac FCS error register</description>
	<addressOffset>0x00010340</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACFCSERRORCOUNT</name>
	<description>The number of received frames that were discarded due to an incorrect FCS. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_MACRXADDRFAILFRMCNT_REG</name>
	<description>Discarded frames register</description>
	<addressOffset>0x00010318</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACRXADDRFAILFRMCNT</name>
	<description>Frames discarded due to incorrect address or PAN Id </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_MACRXSTDACKFRMOKCNT_REG</name>
	<description>Received acknowledgment frames</description>
	<addressOffset>0x00010314</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACRXSTDACKFRMOKCNT</name>
	<description>Standard Acknowledgment frames received </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_MACRXUNSUPFRMCNT_REG</name>
	<description>Unsupported frames register</description>
	<addressOffset>0x0001031c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACRXUNSUPFRMCNT</name>
	<description>Frames which do pass the checks but are not supported </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_MACTSTXACKDELAYVAL_REG</name>
	<description>Time left until next ACK is sent (us)</description>
	<addressOffset>0x00010078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>MACTSTXACKDELAYVAL</name>
	<description>The time in us left until the ack frame is sent by the lmac </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_MACTXSTDACKFRMCNT_REG</name>
	<description>Transmitted acknowledgment frames</description>
	<addressOffset>0x00010310</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MACTXSTDACKFRMCNT</name>
	<description>Standard Acknowledgment frames transmitted </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_0_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x00010180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x76543210</resetValue>
	<resetMask>0x77777777</resetMask>
	<fields><field>
	<name>RXBITPOS_7</name>
	<description>See rxBitPos_0 </description>
	<bitRange>[30:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXBITPOS_6</name>
	<description>See rxBitPos_0 </description>
	<bitRange>[26:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXBITPOS_5</name>
	<description>See rxBitPos_0 </description>
	<bitRange>[22:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXBITPOS_4</name>
	<description>See rxBitPos_0 </description>
	<bitRange>[18:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXBITPOS_3</name>
	<description>See rxBitPos_0 </description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXBITPOS_2</name>
	<description>See rxBitPos_0 </description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXBITPOS_1</name>
	<description>See rxBitPos_0 </description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXBITPOS_0</name>
	<description>Control rxBitPos(8)(3) controls the position that a bit should have at the DPHY interface.
So the default values are rxBitPos_0 = 0, rxBitPos_1 = 1, rxBitPos_2 = 2, etc.

