nguyentri/da-pac/svd/DA14681.svd
	<registers>
	<register>
	<name>IR_CTRL_REG</name>
	<description>IR control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>IR_IRQ_EN</name>
	<description>1 = Enables the interrupt generation upon TX completion
0 = masks out the interrupt generation upon TX completion
</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IR_LOGIC_ONE_FORMAT</name>
	<description>1 = Logic one starts with a Space followed by a Mark
0 = Logic one starts with a Mark followed by a Space
</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IR_LOGIC_ZERO_FORMAT</name>
	<description>1 = Logic zero starts with a Space followed by a Mark
0 = Logic zero starts with a Mark followed by a Space</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IR_INVERT_OUTPUT</name>
	<description>1 = IR output is inverted
0 = IR output is not inverted
</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IR_REPEAT_TYPE</name>
	<description>1 = repeat command is defined at Repeat FIFO
0 = repeat command is defined at Code FIFO
</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IR_TX_START</name>
	<description>1 = IR transmits a command
0 = IR is stopped
While this bit is 1 and SW programs it to 0, the code FIFO will be flushed automatically.
</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IR_ENABLE</name>
	<description>1 = IR block is enabled
0 = IR block is disabled and at reset state. This also resets the pointers at the FIFOs
</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IR_REP_FIFO_RESET</name>
	<description>1 = Flush Repeat FIFO (auto clear)</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>IR_CODE_FIFO_RESET</name>
	<description>1 = Flush Code FIFO (auto clear)</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>IR_FREQ_CARRIER_OFF_REG</name>
	<description>Defnes the carrier signal low duration</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>IR_FREQ_CARRIER_OFF</name>
	<description>Defines the carrier signal low duration in IR_clk cycles</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>IR_FREQ_CARRIER_ON_REG</name>
	<description>Defines the carrier signal  high duration</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>IR_FREQ_CARRIER_ON</name>
	<description>Defines the carrier signal high duration in IR_clk cycles. 0x0 is not allowed as a value.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>IR_IRQ_STATUS_REG</name>
	<description>IR interrupt status register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>IR_IRQ_ACK</name>
	<description>When read Interrupt line is cleared</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>IR_LOGIC_ONE_TIME_REG</name>
	<description>Defines the logic one waveform</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000101</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IR_LOGIC_ONE_MARK</name>
	<description>Defines the mark duration in carrier clock cycles. Must be &gt;0</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IR_LOGIC_ONE_SPACE</name>
	<description>Defines the space duration in carrier clock cycles. Must be &gt;0</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>IR_LOGIC_ZERO_TIME_REG</name>
	<description>Defines the logic zero wavefrom</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000101</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IR_LOGIC_ZERO_MARK</name>
	<description>Defines the mark duration in carrier clock cycles. Must be &gt;0</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IR_LOGIC_ZERO_SPACE</name>
	<description>Defines the space duration in carrier clock cycles. Must be &gt;0</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>IR_MAIN_FIFO_REG</name>
	<description>Main fifo write register</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IR_CODE_FIFO_DATA</name>
	<description>Code FIFO data write port</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>IR_REPEAT_FIFO_REG</name>
	<description>Repeat fifo write register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IR_REPEAT_FIFO_DATA</name>
	<description>Repeat FIFO data write port</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>IR_REPEAT_TIME_REG</name>
	<description>Defines the repeat time</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>IR_REPEAT_TIME</name>
	<description>Defines the repeat time in carrier clock cycles. The repeat timer will start counting from the start of the command and will trigger the output of the same command residing in the Code FIFO or the special command residing in the Repeat FIFO as soon as it expires.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>IR_STATUS_REG</name>
	<description>IR status register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields><field>
	<name>IR_BUSY</name>
	<description>1 = IR generator is busy sending a message
0 = IR generator is idle
</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IR_REP_FIFO_WRDS</name>
	<description>Contains the amount of words in Repeat FIFO (updated only on write)</description>
	<bitRange>[9:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IR_CODE_FIFO_WRDS</name>
	<description>Contains the amount of words in Code FIFO (updated only on write)</description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>KBSCAN</name>
	<version>1.0</version>
	<description>KBSCAN registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001600</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>92</size>
	<usage>registers</usage>
</addressBlock>
	
