nguyentri/da-pac/svd/DA14681.svd
	<registers>
	<register>
	<name>CAPTIM_CAPTURE_GPIO1_REG</name>
	<description>Capture Timer value for event on GPIO1</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAPTIM_CAPTURE_GPIO1</name>
	<description>Gives the Capture time for event on GPIO1</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CAPTIM_CAPTURE_GPIO2_REG</name>
	<description>Capture Timer value for event on GPIO2</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAPTIM_CAPTURE_GPIO2</name>
	<description>Gives the Capture time for event on GPIO2</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CAPTIM_CTRL_REG</name>
	<description>Capture Timer control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CAPTIM_SYS_CLK_EN</name>
	<description>'1' When Capture Timer use the system clock else use the clock 32KHz</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CAPTIM_FREE_RUN_MODE_EN</name>
	<description>Only when timer counts up, if it is '1' timer does not zero when reaches to reload value. it is zero only when it has the max value.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CAPTIM_IRQ_EN</name>
	<description>'1' When Capture timer IRQ unmask, '0' masked</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CAPTIM_IN2_EVENT_FALL_EN</name>
	<description>'1' When Input1 event type is falling edge, '0' rising edge</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CAPTIM_IN1_EVENT_FALL_EN</name>
	<description>'1' When Input2 event type is falling edge, '0' rising edge</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CAPTIM_COUNT_DOWN_EN</name>
	<description>'1' when timer counts down, '0' count up</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CAPTIM_ONESHOT_MODE_EN</name>
	<description>'1' Capture Timer in OneShot mode, '0' Capture/Timer mode</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CAPTIM_EN</name>
	<description>'1' Capture Timer enabled, else disabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CAPTIM_GPIO1_CONF_REG</name>
	<description>Capture Timer gpio1 selection</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>CAPTIM_GPIO1_CONF</name>
	<description>Select one of the 37 GPIOs as IN1, Valid value 0-37. 1 for P00 .. 37 for P47. When 0 Disable input</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CAPTIM_GPIO2_CONF_REG</name>
	<description>Capture Timer gpio2 selection</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>CAPTIM_GPIO2_CONF</name>
	<description>Select one of the 37 GPIOs as IN2, Valid value 0-37. 1 for P00 .. 37 for P47. When 0 Disable input</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CAPTIM_PRESCALER_REG</name>
	<description>Capture Timer prescaler value</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAPTIM_PRESCALER</name>
	<description>Define the timer count frequncy. Freq = Freq_clock / (value+1)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CAPTIM_PRESCALER_VAL_REG</name>
	<description>Capture Timer interrupt status register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAPTIM_PRESCALER_VAL</name>
	<description>Gives the current prescaler value</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CAPTIM_PWM_DC_REG</name>
	<description>Capture Timer pwm dc register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAPTIM_PWM_DC</name>
	<description>Define the PWM duty cyucle = pwm_dc / ( pwm_freq+1)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CAPTIM_PWM_FREQ_REG</name>
	<description>Capture Timer pwm frequency register. PWM5 period is defined by the reference clock frequency multiplied by this value.</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAPTIM_PWM_FREQ</name>
	<description>Define the PWM frequency. = prescaler frequency / (value+1)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CAPTIM_RELOAD_REG</name>
	<description>Capture Timer reload value and Delay in shot mode</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAPTIM_RELOAD</name>
	<description>Reload or max value in timer mode, Delay phase duration in oneshot mode. Actual delay is the register value plus synchronization time (3 clock cycles)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CAPTIM_SHOTWIDTH_REG</name>
	<description>Capture Timer Shot duration in shot mode</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAPTIM_SHOTWIDTH</name>
	<description>Shot phase duration in oneshot mode</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CAPTIM_STATUS_REG</name>
	<description>Capture Timer status register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>CAPTIM_ONESHOT_PHASE</name>
	<description>0 : Wait for event, 1 : Delay phase, 2 : Start Shot, 3 : Shot phase</description>
	<bitRange>[3:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CAPTIM_IN2_STATE</name>
	<description>Gives the logic level of the IN1</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CAPTIM_IN1_STATE</name>
	<description>Gives the logic level of the IN2</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CAPTIM_TIMER_VAL_REG</name>
	<description>Capture Timer counter value</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CAPTIM_TIMER_VALUE</name>
	<description>Gives the current timer value</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>TRNG</name>
	<version>1.0</version>
	<description>TRNG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50005000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>12</size>
	<usage>registers</usage>
</addressBlock>
	
